Add readme, refine docs and add comments to code
